// 1. Создайте массив с элементами 1, 2, 3. Выведите на экран каждый из этих элементов.

let array = [1, 2, 3];
alert(array[0]);
alert(array[1]);
alert(array[2]);

// 2. Дан следующий массив:

    let arr = [1, 2, 3];

// Выведите на экран каждый из его элементов.

alert(arr[0]);
alert(arr[1]);
alert(arr[2]);

// 3. Дан следующий массив:

    arr = [1, 2, 3];

// Выведите на экран сумму элементов этого массива.

alert(arr[0] + arr[1] + arr[2]);

// 4. Дан следующий массив:

    arr = ['a', 'b', 'c', 'd'];

// Выведите с помощью этого массива следующую строку:

    'a+b+c+d'

alert(arr[0] + '+' + arr[1] + '+' + arr[2] + '+' + arr[3]);