// 1. Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо первого элемента число 1, вместо второго - 2, вместо третьего - 3.

let array = ['a', 'b', 'c'];
array[0] = 1;
array[1] = 2;
array[2] = 3;

// 2. Создайте массив с числами. Прибавьте к каждому элементу массива число 3. Выведите на экран измененный массив.

let arrayOfNumbers = [1, 2, 3];
arrayOfNumbers[0] += 3;
arrayOfNumbers[1] += 3;
arrayOfNumbers[2] += 3;
alert(arrayOfNumbers);

// 3. Создайте массив с элементами 1, 2 и 3. С помощью оператора ++ увеличьте каждый элемент массива на единицу.

let arrayOfNumbers2 = [1, 2, 3];
arrayOfNumbers2[0]++;
arrayOfNumbers2[1]++;
arrayOfNumbers2[2]++;