// В следующих задачах некоторый программист написал код и, возможно, допустил в нем ошибки. Вы должны проверить, делает ли код то, что описано. Если код работает некорректно, вы должны исправить ошибки.
// 1. Код должен вывести последний элемент массива:

    let arr = [1, 2, 3, 4, 5];
    // console.log(arr[arr.length]);
    console.log(arr[arr.length - 1]);

// 2. Код должен найти сумму элементов массива:

    arr = [1, 2, 3, 4, 5];
    // console.log(arr[1] + arr[2] + arr[3] + arr[4] + arr[5]);
    console.log(arr[0] + arr[1] + arr[2] + arr[3] + arr[4]);

// 3. Код должен вывести длину массива:

    // arr = {1, 2, 3, 4, 5};
    // console.log(arr.length]);
    arr = [1, 2, 3, 4, 5];
    console.log(arr.length);

// 4. Код должен вывести длину массива:

    arr = [1, 2, 3, 4, 5];
    // console.log(arr.lenght);
    console.log(arr.length);