// 1. Дан объект:

    let obj = {
        '1a': 1,
        'b2': 2,
        'с-с': 3,
        'd 4': 4,
        'e5': 5
    };

// Для каких ключей данного объекта кавычки обязательны, а для каких нет?

// Ответ: кавычки обязательны для ключей '1a', 'с-с' и 'd 4'.

// 2. Исправьте ошибки, допущенные в следующем коде:

    obj = {
        '1a': 1,
        'b2': 2,
        'с-с': 3,
        'd 4': 4,
        'e5': 5
    };

    console.log(obj['1a']); // Исправлено. Было: console.log(obj.1a);
    console.log(obj.b2);
    console.log(obj['c-c']); // Исправлено. Было: console.log(obj.c-c);
    console.log(obj['d 4']); // Исправлено. Было: console.log(obj.d 4);
    console.log(obj.e5);