// 1. В следующем коде ключ должен был взяться из переменной. Исправьте допущенную ошибку:

    let key = 'x';

    let obj = {
        [key]: 1, // Исправлено. Было: "key: 1,"
        y: 2,
        z: 3
    };

// 2. Дан объект:

    obj = {
        [key1]: 1, // Исправлено. Было: "x: 1,"
        [key2]: 2, // Исправлено. Было: "y: 2,"
        [key3]: 3  // Исправлено. Было: "z: 3"
    };

// Даны переменные:

    let key1 = 'x';
    let key2 = 'y';
    let key3 = 'z';

// Сделайте так, чтобы ключи объекта брались из этих переменных.