// 1. Не запуская код, определите, что выведется в консоль:

    console.log( typeof {x: 1, y: 2, z: 3} );

// Ответ: 'object'

// 2. Не запуская код, определите, что выведется в консоль:

    console.log( typeof {} );

// Ответ: 'object'

// 3. Не запуская код, определите, что выведется в консоль:

    obj = {x: 1, y: 2, z: 3};
    console.log( typeof obj );

// Ответ: 'object'

// 4. Не запуская код, определите, что выведется в консоль:

    obj = {x: 1, y: 2, z: 3};
    console.log( typeof obj['x'] );

// Ответ: 'number'