// 1. Дан следующий код:

    let test = {x: 1, y: 2, z: 3};
    console.log(test);

// Какой тип данных выведется в консоль? Это примитив или объект?

// Ответ: 'object'. Объект.

// 2. Дан следующий код:

    test = {x: 1, y: 2, z: 3};
    console.log(test.x);

// Какой тип данных выведется в консоль? Это примитив или объект?

// Ответ: 'number'. Примитив.

// 3. Дан следующий код:

    test = [1, 2, 3];
    console.log(test);

// Какой тип данных выведется в консоль? Это примитив или объект?

// Ответ: 'object'. Объект.

// 4. Дан следующий код:

    test = [1, 2, 3];
    console.log(test[1]);

// Какой тип данных выведется в консоль? Это примитив или объект?

// Ответ: 'number'. Примитив.

// 5. Дан следующий код:

    let test1 = [1, 2, 3];
    let test2 = 1;

    console.log(test1);

// Какой тип данных выведется в консоль? Это примитив или объект?

// Ответ: 'object'. Объект.

// 6. Дан следующий код:

    test1 = [1, 2, 3];
    test2 = 1;

    console.log(test1[test2]);

// Какой тип данных выведется в консоль? Это примитив или объект?

// Ответ: 'number'. Примитив.

// 7. Не подсматривая в учебник перечислите все примитивные типы данных в JavaScript.

// Ответ: string, number, boolean, null, undefined, symbol, bigint.