// 1. Что выведется в результате выполнения следующего кода:

    const arr1 = ['a', 'b', 'c'];
    arr1[1] = '!';
    console.log(arr1);

// Ответ: ['a', '!', 'c']

// 2. Что выведется в результате выполнения следующего кода:

    const arr2 = ['a', 'b', 'c'];
    arr2 = [1, 2, 3];
    console.log(arr2);

// Ответ: ['a', 'b', 'c']

// 3. Что выведется в результате выполнения следующего кода:

    const arr3 = ['a', 'b', 'c'];
    arr3 = ['a', 'b', 'c'];
    console.log(arr3);

// Ответ: ['a', 'b', 'c']