/*
 В следующих задачах некоторый программист написал код и, возможно, допустил в нем ошибки.
 Вы должны проверить, делает ли код то, что описано.
 Если код работает некорректно, вы должны исправить ошибки.
*/

// 1. Код должен вывести элемент объекта:

    let obj1 = {x: 1, y: 2, z: 3};
    console.log(obj1.x); // Изменено. Было: "console.log(obj1[x]);"

// 2. Код должен вывести элемент объекта по ключу из переменной:

    let obj2 = {x: 1, y: 2, z: 3};
    let key = 'x';

    console.log(obj2[key]); // Изменено. Было: "console.log(obj2.key);"

// 3. Код должен вывести сумму элементов объекта:

    let obj3 = {x: 1, y: 2, z: 3};
    let sum = obj3.x + obj3.y + obj3.z; // Изменено. Было: "let sum = obj3[x] + obj3[y] + obj3[x];"

    console.log(sum); // Изменено. Было: "console.log(obj3);"

// 4. Код должен вывести количество элементов объекта:

    let obj4 = {x: 1, y: 2, z: 3};
    console.log(Object.keys(obj4).length); // Изменено. Было: "console.log(obj4.length);"