// 1. Не запуская код, определите, что выведется в консоль:

    let test1 = '3';
    let test2 = '3';

    if (test1 != test2) {
        console.log('+++');
    } else {
        console.log('---');
    }

// Ответ: '---'.

// 2. Не запуская код, определите, что выведется в консоль:

    test1 = '3';
    test2 = '3';

    if (test1 !== test2) {
        console.log('+++');
    } else {
        console.log('---');
    }

// Ответ: '---'.

// 3. Не запуская код, определите, что выведется в консоль:

    test1 = 3;
    test2 = '3';

    if (test1 != test2) {
        console.log('+++');
    } else {
        console.log('---');
    }

// Ответ: '---'.

// 4. Не запуская код, определите, что выведется в консоль:

    test1 = 3;
    test2 = '3';

    if (test1 !== test2) {
        console.log('+++');
    } else {
        console.log('---');
    }

// Ответ: '+++'.

// 5. Не запуская код, определите, что выведется в консоль:

    test1 = 3;
    test2 = 2;

    if (test1 !== test2) {
        console.log('+++');
    } else {
        console.log('---');
    }

// Ответ: '+++'.