// 1. В переменной day лежит какое-то число из интервала от 1 до 31.
//    Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

    let day;

    if (day >= 1 && day <= 10) {
        console.log('Число попадает в первую декаду месяца');
    } else if (day >= 11 && day <= 20) {
        console.log('Число попадает во вторую декаду месяца');
    } else if (day >= 21 && day <= 31) {
        console.log('Число попадает в третью декаду месяца');
    }

// 2. Модифицируйте предыдущую задачу так, чтобы, если в переменной day будет не число от 1 до 31,
//    выдавалось сообщение об ошибке.

    else console.log('Ошибка. Число должно быть от 1 до 31!');