// 1. Пусть даны следующие переменные:

    let a = 2 * (3 - 1);
    let b = 6 - 2;

// Используя оператор ==, узнайте, равны ли значения этих переменных или нет.

    // Ответ:
    console.log(a == b);

// 2. Пусть даны следующие переменные:

    let a = 5 * (7 - 4);
    let b = 1 + 2 + 7;

// Используя оператор >, узнайте, больше ли переменная a, чем b.

    // Ответ:
    console.log(a > b);

// 3. Пусть даны следующие переменные:

    let a = 2 ** 4;
    let b = 4 ** 2;

// Используя операцию оператор !=, узнайте, разные ли значения этих переменных или нет.

    // Ответ:
    console.log(a != b);